--[[
   _      _    _ __         __ _   ________       __           ______      _ _____   __        __
  | |    | |  | |\ \       / /| | |______ /      /  \         | |__\ \    | |_____|  \ \      / /
  | |____| |  | | \ \     / / | |     / /       / /\ \        | |   \ \   | |_____    \ \    / /
  | |____| |  | |  \ \   / /  | |    / /       / /__\ \       | |    ) )  | |_____|    \ \  / /
  | |    | |  | |   \ \_/ /   | |   / /____   / / __ \ \   _  | |__ / /   | |_____      \ \/ /
  |_|    |_|  |_|    \___/    |_|  /_______| /_/      \ \ |_| |_|_ /_/    |_|_____|      \__/    
   Dev.@hmza97  
                                                      
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "م1" then
return [[
🏆🏆 - اوامر الادمن في الكروب👑👑
💯💯💯💯💯💯💯💯💯💯💯💯💯
-----اوامر القفل + فتح 👇

🔒قفل+الامر : ل غلق 
🔓فتح+الامر : للسماح 

🦁–🏢 الاضافه
🦁–🚧البوتات
🦁–🀄المجموعه
🦁–📛 الدردشه
🦁–📷 الصور 
🦁–🔔الصوت
🦁–📹 الوسائط
🦁–🎥 الفيديو
🦁–📌 الروابط
🦁–📇 التكرار 
🦁–📜الملصقات
🦁–📱 الصور المتحركه 
🦁–📁 الفايلات 
🦁–📅 الكلايش 
🦁–🔔 الاضافه الجماعيه 
🦁–📰 العربيه   
🦁–🎉اعاده توجيه
🦁–🎭الجيوش
〰〰〰〰〰〰〰〰〰〰
-----اوامر ال مسح✏👇:
🦁–🃏رسائل المجموعه :لحذف جميع رسائل الكروب
🦁–🃏مسح رسائل العضو: مسح جميع رسائل العضو بالرد
🦁–📣مسح الادمنية : لحذف الادمنية
🦁–🔦مسح الوصف : لحذف الوصف
🦁–🔦مسح القوانين : لحذف القوانين
🦁–🔦-مسح المعرف : لحذف معرف المجموعة 
🦁–🔦مسح : لمسح اي  كلمه بل رد

----اوامر وضع🔎👇:
🦁–📛ضع قوانين : اضافه قوانين
🦁–📓ضع وصف : اضافة حول 
🦁–📋وضع اسم : لاضافة اسم
🦁–💾ضع معرف: لوضع معرف للكروب
🦁–🔌وضع تكرار +الرقم:ل تعين التكرار 
🦁–📠الرابط خاص : لجلب الرابط خاص
🦁–📧الرابط : لعرض الرابط
🦁–📮تغير الرابط : لصنع الرابط

----اوامر خارجية: 🎩👇

🦁–🔖ايدي : لعرض ايدي المجموعه
🦁–👀ايدي ب الرد: ل عرض ايدي الشخص ب الرد
🦁–💾معلوماتي :اضهار المعلومات الخاصه بك
🦁–🚨معلومات المجموعه : لاضهار معلومات المجموعه
🦁–🚓القوانين : لاضهار القوانين
🦁–📝زخرفه+ النص : لزخرفه بالعربيه
🦁–📝زخرف+ النص: لزخرفه بالنكليزيه 
__________________

Dev - @hmza97
Channel - @dq12bo
Channel - @HmzaDev
]]
end

if not is_momod(msg) then
return "مو شغلك ..لا تبعبص بكيفك✋👊"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(م1)"
},
run = run 
}
end
