
--[[
   _      _    _ __         __ _   ________       __           ______      _ _____   __        __
  | |    | |  | |\ \       / /| | |______ /      /  \         | |__\ \    | |_____|  \ \      / /
  | |____| |  | | \ \     / / | |     / /       / /\ \        | |   \ \   | |_____    \ \    / /
  | |____| |  | |  \ \   / /  | |    / /       / /__\ \       | |    ) )  | |_____|    \ \  / /
  | |    | |  | |   \ \_/ /   | |   / /____   / / __ \ \   _  | |__ / /   | |_____      \ \/ /
  |_|    |_|  |_|    \___/    |_|  /_______| /_/      \ \ |_| |_|_ /_/    |_|_____|      \__/    
   Dev.@hmza97  
                                                      
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "م3" then
return [[اوامر المطورين فقط
🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
🦁–🔛ترقيه سوبر : لترقيه المجموعه سوبر
🦁–♻تفعيل المجموعه  : لتفعيل البوت ب المجموعه
🦁–📴تعطيل المجموعه : لتعطيل البوت ب المجموعه
🦁–👷رفع المدير : لرفع مدير للمجموعه 
🦁–👮رفع اداري : لرفع اداري للمجموعه 
🦁–📣اذاعه او نشر + الكلام : لنشر كلمه ب جميع مجموعات البوت
🦁–🔃تشغيل البوت : لتشغيل البوت ب المجموعه معينه
🦁–📴اطفاء البوت :  لاطفاء البوت ب المجموعه معينه
🦁–👔 اضف مطور : لاضافه مطور
🦁–🚶طرد البوت : لطرد البوت من المجموعه
🦁–📂جلب ملف  : لجلب الملف من السيرفر
🦁–📇فحص السيرفر : لفحص السيرفر كل 5 دقايق
🦁–🚥حضر عام :ل حظر المستخدم عام
🦁–🚏الغاء العام : ل رفع الحظر العام عن الشخص
🦁–📋قائمه العام : ل عرض المحظورين عام من البوت
🦁–🚀اضف بوت:+ الرابط لضافة البوت للمجموعه بلرابط
🦁–🏣صنع مجموعه + اسم لعمل مجموعه جديد وخارقة

__________________

Dev - @hmza97
Channel - @dq12bo
Channel - @HmzaDev
]]
end

if not is_momod(msg) then
return "مو شغلك و لا تبعبص بكيفك👊"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(م3)"
},
run = run 
}
end
