--[[
   _      _    _ __         __ _   ________       __           ______      _ _____   __        __
  | |    | |  | |\ \       / /| | |______ /      /  \         | |__\ \    | |_____|  \ \      / /
  | |____| |  | | \ \     / / | |     / /       / /\ \        | |   \ \   | |_____    \ \    / /
  | |____| |  | |  \ \   / /  | |    / /       / /__\ \       | |    ) )  | |_____|    \ \  / /
  | |    | |  | |   \ \_/ /   | |   / /____   / / __ \ \   _  | |__ / /   | |_____      \ \/ /
  |_|    |_|  |_|    \___/    |_|  /_______| /_/      \ \ |_| |_|_ /_/    |_|_____|      \__/    
   Dev.@hmza97  
                                                      
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "م2" then
return [[🏆🏆 اوامر الطرد 👌👇:
➖🔸➖🔹➖🔸➖🔹➖ـ
🦁–👡دفره : لطرد العضو بلرد
🦁–⚡بلوك : لطرد العضر ب الرد
🦁–🚀حضر : لحظر المستخدم
🦁–🔙الغاء الحضر : لفك حضر المستخدم #ب اليوزر
🦁–💁منع+الكلمة : لحظر الكلمات في المجموعة
🦁–📴الغاء المنع +الكلمة : لفتح حظر الكلمة
🦁–📄قائمه المنع : لعرض الكلمات المحظورة
🦁–📛كتم + المعرف : لكتم المستخدم
🦁–📛كتم + المعرف : ل الغاء كتم المستخدم
🦁–📃المكتوميين : عرض المكتومين
-----اوامر رفع 👇 :
🦁–👮رفع ادمن : ل رفع المستخدم ادمن
🦁–👨تنزيل ادمن : ل انزال رتبة الادمن
🦁–🚓الادمنيه : ل عرض قائمة الادمنز في الكروب
🦁–👊مغادره : للخروج من لمجموعه
__________________

Dev - @hmza97
Channel - @dq12bo
Channel - @HmzaDev

]]
end

if not is_momod(msg) then
return "مو شغلك و لا تبعبص بكيفك👌"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(م2)"
},
run = run 
}
end
