--[[

   _      _    _ __         __ _   ________       __           ______      _ _____   __        __
  | |    | |  | |\ \       / /| | |______ /      /  \         | |__\ \    | |_____|  \ \      / /
  | |____| |  | | \ \     / / | |     / /       / /\ \        | |   \ \   | |_____    \ \    / /
  | |____| |  | |  \ \   / /  | |    / /       / /__\ \       | |    ) )  | |_____|    \ \  / /
  | |    | |  | |   \ \_/ /   | |   / /____   / / __ \ \   _  | |__ / /   | |_____      \ \/ /
  |_|    |_|  |_|    \___/    |_|  /_______| /_/      \ \ |_| |_|_ /_/    |_|_____|      \__/    

   Dev.@hmza97
                                                      
--]]
do 
ws = {} 
rs = {} 

-- some examples of how to use this :3 
ws[1] = "هلاو" 
rs[1] =  "هـﮩـڵآوآت 🦀❤" 

ws[2] = "هلو" -- msg 
rs[2] = "هـﮩـڵآوآت 🦀❤️" -- reply 

ws[3] = "شلونكم" -- msg 
rs[3] = "تـمـآم وأنتـہ 🌝💙" -- reply 

ws[4] = "دووم" -- msg 
rs[4] = "يدوم نبضك 🌝💙" -- reply 

ws[5] = "كيفك" 
rs[5] = "تـﻣـام وانــت 🌝💙" 

ws[6] = "شلونك" 
rs[6] = "تـمـآم وأنتـہ 🌝💙" 

ws[7] = "غنيلي" 
rs[7] = " 💖احبك انا  🙊 انا احبك 🙉 واتحدى واحد بلبشر متلي يحبك 🙊" 

ws[8] = "شغل المبردة" 
rs[8] = " تم تشغيل المبردة بنجاح ❄️" 

ws[9] = "طفي المبردة" 
rs[9] = "طفيتهه 😒🍃" 

ws[10] = "شغل السبلت" 
rs[10] = "شغلته 🌚🍃 بس حثلجون معليه ترا " 

ws[11] = "مايا خليفة" 
rs[11] = " 😂 عيب صايمين" 

ws[12] = "فطور" 
rs[12] = "واخيراً 😍😍 بدي روح افطر " 

ws[13] = "احمد" 
rs[13] = "💖 🌚🍃" 

ws[14] = "نيكني" 
rs[14] = "ادخله 🍆" 

ws[15] = "تخليني" 
rs[15] = "لـمن يصـير عـندڪ بخليګ 😹🌝" 

ws[16] = "زاحف" 
rs[16] = "🌝😹 هه انته كبير" 

ws[17] = "تركيا" 
rs[17] = "😐🍃 فديتهه" 

ws[18] = "داعش" 
rs[18] = "الدولة التكفيرية في العراق والشام 👈💩" 

ws[19] = "الدولة الاسلامية" 
rs[19] = "انت داعشي ؟؟ 😒💔" 

ws[20] = "عراسي" 
rs[20] = "يـسـلـمراسـك" 
ws[21] = "شيعي" 
rs[21] = "لتصير طائفي 😐💙" 

ws[22] = "تبادل" 
rs[22] = "ماا مليت من التبادل😓😐?•" 

ws[23] = "السوريين" 
rs[23] = "احلى ناس ولله 😻🙈" 

ws[24] = "من وين" 
rs[24] = "شو دخلك زاحف  😹🌶" 

ws[25] = "هاي" 
rs[25] = "هـٱيـآت🙈🍷" 

ws[26] = "البوت" 
rs[26] = "ماعاجبك؟ تعاال محلي😕😒🍃" 

ws[27] = "البوت نايم" 
rs[27] = "لاتكذب🙄💙" 

ws[28] = "مين عم يحذف" 
rs[28] = "ماحـــدا 🏌" 

ws[29] = "كلاش اوف كلانس" 
rs[29] = "تلعبها?..شقد لفلك" 

ws[30] = "تشاكي" 
rs[30] ="??😘😼هادا مشكلجي اتركوه بحالو " 

ws[31] = "ازحف " 
rs[31] = "عـلـﻰ حبيبتك ٱزحـف 🐉" 

ws[32] = "اكطع" 
rs[32] = " سِـلُـطِـُه مٌـنَ بّْعـدِ 😅الُبّـ🤖ـوَتْ🎄 " 

ws[33] = "بوت" 
rs[33] ="الـَبـوت يــعمــل الٱن " 

ws[34] = "بدي بوت" 
rs[34] = " بـدك بوت يشتغل 24 ساعة بكروبك راسلني اضيفو  @hmza97"

ws[35] = "بدي اعشق" 
rs[35] = "زُاحُــفَ مٌوَوَ بّإيَــدِكِ 😒😂" 

ws[38] = "اسكت" 
rs[38] = "انــت اخرس😑👊" 

ws[39] = "كفرون" 
rs[39] = " 💖احلى ناس ولله💚 " 

ws[40] = "المدرسة" 
rs[40] = "😒🍃 الله لا يـرويـنا" 

ws[41] = "تحبني" 
rs[41] = "اعـشقـڪ😻" 

ws[42] = " يعني شقد" 
rs[42] = "فوق  ما تتوقع😜" 

ws[43] = "😂" 
rs[43] = " دوم حبي ❤️" 

ws[44] = "هههه" 
rs[44] = "❀دِْوم حبيْ❀" 

ws[45] = "ههههه" 
rs[45] = "️❀دِْوم حبيْ❀" 

ws[46] = "😹" 
rs[46] = "❀دِْوم حبيْ❀" 

ws[47] = "🌚" 
rs[47] = "  مــنــور يـا غبي 🌚😹" 

ws[48] = "😍" 
rs[48] = "آإمـ﴿😚﴾ـح" 

ws[49] = "مح" 
rs[49] = "عہ🍯🙊سہل" 

ws[50] = "انمي" 
rs[50] = "اته اوتاكو ؟ ❤️" 

ws[51] = "منحرف" 
rs[51] = "وينو اطردو ➪  🌚☝️🏻" 

ws[52] = "😭" 
rs[52] = "😢 لا👈تـبـكـي 😿" 

ws[53] = "😢" 
rs[53] = "😢 لا👈تبـكـي 😿" 

ws[54] = "سورس" 
rs[54] = "@HmzaDev" 

ws[55] = "وينها" 
rs[55] = "زاحـﮩـف 😹" 

ws[56] = "اقرالي دعاء" 
rs[56] = " اللهم عذب المدرسين 😢 منهم الاحياء والاموات 😭🔥 اللهم عذب ام الانكليزي 😭💔 وكهربها بلتيار الرئيسي 😇 اللهم عذب ام الرياضيات وحولها الى غساله بطانيات 🙊 اللهم عذب ام الاسلاميه واجعلها بائعة الشاميه 😭🍃 اللهم عذب ام العربي وحولها الى بائعه البلبي اللهم عذب ام الجغرافيه واجعلها كلدجاجه الحافية اللهم عذب ام التاريخ وزحلقها بقشره من البطيخ وارسلها الى المريخ اللهم عذب ام الاحياء واجعلها كل مومياء اللهم عذب المعاون اقتله بلمدرسه بهاون 😂😂😂" 

ws[57] = "غبي" 
rs[57] = " انـت ٱڵٱغبۍ" 

ws[58] = "دي" 
rs[58] = "شـبـك هـدي شـوي" 

ws[59] = "مين حبيبتك" 
rs[59] = "ٲخـتڪ 🙈" 

ws[60] = "تكرهني" 
rs[60] = "ٲمـوت منڪ 😖" 

ws[61] = "اكرهك" 
rs[61] = "على اساس انا احبك هه☹" 

ws[62] = "😂" 
rs[62] = "❀دِْوم حبيْ❀" 

ws[63] = "حلب" 
rs[63] = " احسن ناس وربي💖❤️" 

ws[64] = "حمص" 
rs[64] = " احسن ناس وربي❤️" 

ws[65] = "الشام" 
rs[65] = " احسن ناس وربي❤️" 

ws[66] = "حماه" 
rs[66] = ".💗احسن ناس وربي" 

ws[67] = "😇" 
rs[67] = "بـاايــخ/ـة 🐛" 

ws[68] = "😐" 
rs[68] = "شـبك صــافن😒👋🏻" 

ws[69] = "انجب" 
rs[69] = "بـحـلكڪ😒💦" 

ws[70] = "حارة" 
rs[70] = "ايَيَ  لـيـش خـايـف⚶ " 

ws[71] = "خالتك" 
rs[71] = " راح اطـﮩـردڪ ڵـﮩۦـڪ 😒🐞" 

ws[72] = "اطرد البوت" 
rs[72] = " راح ابقة احترمك❤️" 

ws[73] = "هه" 
rs[73] = " شوفو انــه شخصية♕😜 🕊" 

ws[74] = "مابحبك" 
rs[74] = "  نـہـفـہس الـہشـ؏ـور 🍁🐎" 

ws[75] = "اقلك" 
rs[75] = " قــول ۾ـا ﺑﻗﯛل لـحـــدا   🐿" 

ws[76] = "اكلك" 
rs[76] = " ڪـﮩﮩۛﮩـوڵ مـاكـوڵ لٱحـﮩـد 🐿" 

ws[78] = "سوريا" 
rs[78] = " 😍 فديتههااا" 

ws[79] = "ادلب" 
rs[79] = " احسن ناس وربي💛❤️" 

ws[80] = "تركماني" 
rs[80] = " والنعم منك❤️" 

ws[81] = " @hmza97" 
rs[81] = "  مـطـورنـي ♥♥ 😻💙 @hmza97" 

ws[83] = "باي" 
rs[83] = "❈بــايــات♡" 

ws[84] = "تنح" 
rs[84] = "عـيـب ٲبـنـي 😒🍃" 

ws[85] = "جوعان" 
rs[85] = "تـ؏ـال كـلـني☺ 😐😂" 

ws[86] = "عطشان" 
rs[86] = "روح ٲشـﮩـرب مــيي" 

ws[87] = "صايم" 
rs[87] = "شــو اساويلك 😐🍃" 

ws[88] = "☹️" 
rs[88] = "لـﮩـضـوج פـٍـٍبيبي  😢❤️🍃" 

ws[89] = "😔" 
rs[89] = " لـﮩـيـﺵ ضـٲيـﮩـج 😿🍃" 

ws[90] = "فرخ" 
rs[90] = "اذا ابوك فرخ انا فرخ😱😱" 

ws[92] = "كسمك" 
rs[92] = " عيب 😱😱😱" 

ws[93] = "شحاطة" 
rs[93] = " بـﮩـوجـهـڪ 😐😂" 

ws[94] = "بدي روح اسبح" 
rs[94] = " واخيراً 😹🌝" 

ws[95] = "بدي روح غسل" 
rs[95] = " واخيراً 😹🌝" 

ws[96] = "بدي اتزوج" 
rs[96] = " واخيراً 😹🌝" 

ws[97] = "حبيبتي" 
rs[97] = "عم تخونك☺😉😔☹" 

ws[98] = "عشقت" 
rs[98] = " بلخير 😂💔" 

ws[99] = "البوت بايخ" 
rs[99] = " اطردك ؟ 😒" 

ws[100] = "منور" 
rs[100] = " بـﮩـنورك حـﮩـبـﮩـي 😍🍷" 

ws[101] = "افلش" 
rs[101] = " 👞🔰افلش راسك" 

ws[102] = "سني" 
rs[102] = "والنعم منك😘❤️" 

ws[103] = "طفي المكيف" 
rs[103] = " تم  اطفاء المكيف بنجاح 🌚🍃" 

ws[104] = "🌝" 
rs[104] = "مــﮩﮩﮩــننوورر 🌝💙" 

ws[105] = "اذن المغرب" 
rs[105] = "ٲسـﮩـتـحـﮩـرم 🌚🍃" 

ws[106] = "حلو" 
rs[106] = "ٱنـﮩـت الاحـلآ 🌚❤️️" 

ws[107] = "احبك" 
rs[107] = " انا اكتر💖😍🍃" 

ws[108] = "😑" 
rs[108] = " شبك 🍃☹" 

ws[109] = "😒" 
rs[109] = "شبك قالب وجهك   😐" 

ws[110] = "مين تحب" 
rs[110] = " خالتك الشقرة 😹🏃🏻" 

ws[111] = "بكرا العيد" 
rs[111] = "كل عام وانت بالف خير حبي 😇❤️" 

ws[112] = "فديت" 
rs[112] = "ها  زاحف كمشتك" 

ws[113] = "مضغوط" 
rs[113] = "دي انضغظ منك ؟ 😂😂" 

ws[114] = "فديت" 
rs[114] = "اها  زاحف كمشتك" 

ws[115] = "فديتك" 
rs[115] = "اها  زاحف كمشتك" 

ws[116] = "فديتج" 
rs[116] = "ها  زاحف كمشتك" 

ws[117] = "شوف الخاص" 
rs[117] = "شبدك تبعتلو 😱😨" 

ws[118] = "تعال خاص" 
rs[118] = "خدوني معكن ☺ 😱" 

ws[119] = "تعالي خاص" 
rs[119] = "خدوني معكن 😱" 

ws[120] = "دخل السبام" 
rs[120] = "شحسوون 😱" 

ws[121] = "😎" 
rs[121] = "شبهتك لفردة خفافتي السودا👞😐🍃" 

ws[122] = "😱" 
rs[122] = "خير خوفتني 😨" 

ws[123] = "قحبة" 
rs[123] = "هي امك 😂😱" 

ws[124] = "اديش الساعة" 
rs[124] = "ما بعرف 🌚🍃" 

ws[125] = "🚶🏻" 
rs[125] = "لا تضل تتمشا بروك حاكينا 🤖👋🏻" 

ws[126] = "مين اكتر وحدة بتحبا" 
rs[126] = "خالتك" 

ws[127] = "ليش" 
rs[127] = "هـيـك😏👉" 

ws[128] = "طاسة" 
rs[128] = "امك حلوة ورقاصة 💃🏻" 

ws[129] = "عشرين" 
rs[129] = "تاكل جدر خنين 😫" 

ws[130] = "مي" 
rs[130] = "😂تشرب مميه" 

ws[131] = "اربعة" 
rs[131] = "🚬دقـن ابوك مربعة" 

ws[132] = "فارة" 
rs[132] = "ليش في فيران بوجودك😱😂" 

ws[133] = "ميتين" 
rs[133] = "فـوق راسك قندرتين👞👟" 

ws[134] = "مات" 
rs[134] = "ابو الحمامات 🐦" 

ws[135] = "توفه" 
rs[135] = "ابو اللفه 🌯" 

ws[136] = "احترق" 
rs[136] = "🍷ابو العرق" 

ws[137] = "غرك" 
rs[137] = "ابو العرك 🍾" 

ws[138] = "طار" 
rs[138] = "ابن الطيار" 

ws[139] = "ديسحك" 
rs[139] = "😂😂 هاي بعده" 

ws[140] = "لتسحك" 
rs[140] = "😐😂 وك" 

ws[141] = "المطور" 
rs[141] = "هاذ مطوري @hmza97" 

ws[142] = "اندرويد" 
rs[142] = "احسن نظام بلعالم🌚❤️" 

ws[143] = "سامسنغ" 
rs[143] = "احسن نظام بالعالم ♥" 

ws[144] = "هواوي" 
rs[144] = "فاشل اخرة نوع تلفون🔥☹" 

ws[145] = "سامسونغ" 
rs[145] = "فاشل اخرة نوع تلفون🔥☹" 

ws[146] = "لاتزحف" 
rs[146] = "اوك اسف 🙁😔" 

ws[147] = "حاته" 
rs[147] = "زاحف 😂 منو هاي دزلي صورتهه" 

ws[148] = "حات" 
rs[148] = "زاحفه 😂 منو هذا دزيلي صورته" 

ws[149] = "صاكه" 
rs[149] = "زاحف 😂 منو هاي دزلي صورتهه" 

ws[150] = "صاك" 
rs[150] = "زاحفه 😂 منو هذا دزيلي صورهه" 

ws[151] = "مين انا" 
rs[151] = "انته احلى شي بحياتي ❤️🍃" 

ws[152] = "ابن الكلب" 
rs[152] = "عيب ابني 🔥☹" 

ws[153] = "انجب انته" 
rs[153] = "وك وك 😭😔" 

ws[154] = "بدي اطردك" 
rs[154] = "امسك اعصابك 😨 لاتتهور" 

ws[155] = "مطور" 
rs[155] = " هي معرفو فديتو    @hmza97" 

ws[156] = "مين اكتر واحد بتكرهو" 
rs[156] = "انت" 

ws[157] = "شباب" 
rs[157] = "هًّْـــُ﴿⍨﴾ـٍِٰـــہاا حـﮩـب 🚶🏻🌝" 

ws[158] = "انت زلمة" 
rs[158] = "تعال جرب 😐😂" 

ws[159] = "الاحد" 
rs[159] = "هادا اليوم نحس بلنسبة الي" 

ws[160] = "الاثنين" 
rs[160] = "يوم اجة بي ناس عزيزين وفقدت بي ناس هم ☹" 

ws[161] = "هلاوو" 
rs[161] = "هـﮩـڵآوآت 🦀❤️" 

ws[162] = "اختك" 
rs[162] = "حبيبتي😂💕😱" 

ws[163] = "رامي" 
rs[163] = "دخــيــل ♡ ربــو شــو❥ بـحبـو ♥لمطورني" 

ws[164] = "😌" 
rs[164] = "ٱڵـمـطـڵـوب ¿ ❥" 

ws[165] = "هلا" 
rs[165] = "✾  هـﮩـڵا ہبـﮩـک 💙🖐🏻" 

ws[166] = "مرحبا" 
rs[166] = "✾  مٌـﮩۚـرحـﮩۘـبـتـيـن  💙🖐🏻" 

ws[167] = "سلام" 
rs[167] = "بالتو‏فـ♡ـيق " 

ws[168] = "ابراهيم" 
rs[168] = "دخيل قلبو شو بحبو❥♥" 

ws[169] = "السلام عليكم" 
rs[169] = "✾ وَْ؏ـﮩـڵـيڪم ٲلـﮩـسـلا۾م 💙🖐🏻" 

ws[170] = "تسلم" 
rs[170] = "✾ ٱڵـڵـه يسـلـمـڪ 💙🖐🏻" 

ws[171] = "ممكن" 
rs[171] = "ﺗْـ•ـﮩ؏ْﮩـ•ــ🚶ـاْل طبعااا ممكن 😋" 

ws[173] = "القناة" 
rs[173] = "@dq13bo @HmzaDev" 

ws[174] =  "قناه" 
rs[174] = "@dq13bo @HmzaDev" 

ws[175] = "حمزه" 
rs[175] = "♡مـطـوري ♥حمزه ♡دخـيـل ربو❥" 

ws[176] = "امير حلب" 
rs[176] = "دخيل 💚روحو💭😍مـطـورنـي" 

ws[177] = "😑" 
rs[177] = "شو بيقربك الرجل الصيني😂🙀" 

ws[178] = "😍" 
rs[178] = "مين عشقان يا ملعون 💖??😂" 

ws[179] = "بحبك" 
rs[179] = "وانا مابحبك😎😂" 

ws[180] = "كنغ" 
rs[180] = "اسمو😍هيبة😼كيف لكن هو بزاتو💕😘" 

ws[181] = "شرموطة" 
rs[181] = "اذا هية شرموطة انت شو منقلك يلي مفتوح من قبل 24 ميلون شخص ??😼😹😹😹" 

ws[182] = "🔞" 
rs[182] = "فرجوني ع شو عم تتفرجو 😱😳😂" 

ws[183] = "سكس" 
rs[183] = "لا تزكرني يوم يلي نشرت فيه مقطع عن قصة نيكك😢😂لتخليني مرة ثانية..؟😂" 

ws[184] = "🍆" 
rs[184] = "حدا بياكلها 😂😂" 

ws[185] = "نيكو" 
rs[185] = "هلق بنيكو وبنيك اساسو لعيونك 😍😂" 

ws[186] = "انبعص" 
rs[186] = "انت اكتر واحد شفتك مبعوص بحياتي خليك ساكت😂" 

ws[187] = "كس اختك" 
rs[187] = "اختي متل اختك😇" 

ws[188] = "كس امك" 
rs[188] = "دخيل امك يلي محبلها😂" 

ws[189] = "عاهرة" 
rs[189] = "انت مصدر الدعارة والسكس يا ابو قرون🌝😂" 

ws[190] = "منتاك" 
rs[190] = "شوفو المفتوح يلي عم يحكي😂" 

ws[191] = "ايري" 
rs[191] = "احترم حالك يازبي😂" 

ws[192] = "زبي" 
rs[192] = "ادخله 🍆" 

ws[193] = "زب" 
rs[193] = "فيك😂" 

ws[194] = "طرطوس" 
rs[194] = "احسن💗ناس💖وربي💕" 

ws[195] = "اللادقية" 
rs[195] = "احسن♡ناس♡" 

ws[196] = "الحلبية" 
rs[196] = "💚🍥يئبرني💖😍 الخلئهن " 

ws[197] = "حلبي" 
rs[197] = "🌹عرررااسيي احلا عالم🌹" 

-- the main function 
function run( msg, matches ) 
 -- just a local variables that i used in my algorithm 
 local i = 0; local w = false 

 -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
 -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
 for k,v in pairs(ws) do 
  -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
  if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
   -- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
   i = k; w = true; 
  end 
 end 

 -- check if { w } is not false and { i } not equals to 0 
 if ( (w ~= false) and (i ~= 0) ) then 
  -- get the receiver :3 
  R = get_receiver(msg) 
  -- send him the proper message from the index that { i } assigned to 
  --send_large_msg ( R , rs[i] ); 
  --send_reply(msg.id, rs[i]) 
  reply_msg(msg.id, rs[i], ok_cb, false ) 
 end 
 -- don't edit this section 
 if ( msg.text == "about" ) then 
  if ( msg.from.username == "Mouamle" ) then 
   R = get_receiver(msg) 
   send_large_msg ( R , "Made by @Mouamle" ); 
  end 
 end 

end 

return { 
 patterns = { 
  "(.*)" 
   }, 
   run = run 
} 

end 
